
public class Main {
    public static void main(String[] args) {

        Vehicle 
//                Каждый класс должен реализовать методы интерфейса Vehicle:
//        В методе start() выводите на экран уникальное сообщение для каждого типа транспорта (например, "Автомобиль заводится").
//                В методе stop() выводите сообщение о том, что транспорт остановлен.
//
//        Также создайте класс Garage, в котором будет метод operateVehicle(Vehicle vehicle).
//
//
//
//        Этот метод принимает объект, реализующий интерфейс Vehicle, и вызывает у него методы start() и stop().
//                Требования:
//        1. Реализуйте интерфейс Vehicle и несколько классов для разных типов транспортных средств.
//
//        2. В классе Garage используйте полиморфизм для работы с любым типом транспорта через метод operateVehicle().
//
//        3. Продемонстрируйте работу программы, создав экземпляры каждого вида транспорта и передав их в метод operateVehicle().
//




    }
}